text_privacy = (f"<a href='https://telegra.ph/Politika-konfidencialnosti-07-26-9'>Этот документ описывает политику "
                f"конфиденциальности для бота @MasterManifest_Bot (Мастер Манифестации📖)</a>\n")



text_offer = (f"<a href='https://telegra.ph/Oferta-dlya-chat-bota-Babykea-Bot-Babykea-07-14'>Публичная оферта, "
              f"Пользовательское соглашение, условия эксплуатации и обслуживания </a>\n")


text_hello = (f"<b>Меня зовут Даниил — я создатель этого бота</b> "
              f"\n\nЯ разработал <b>«Мастера Манифестации📖»</b>, чтобы помогать людям находить ответы, "
              f"вдохновение и внутреннюю опору. Долгое время бот работал полностью за мой счёт:"
              f"\n\n💾 я оплачивал хостинг"
              f"\n🤖 доступ к AI"
              f"\n🔧 дорабатывал функционал"
              f"\n📦 обеспечивал стабильную работу"
              f"\n\nМне это было не обременительно и в радость. Но проект вырос, и его поддержка требует больше ресурсов."
              f"\nЯ рассматривал вариант <i>бесплатного доступа за счёт рекламы</i> (например, за подписку на каналы), "
              f"но отказался по важным причинам:"
              f"\n\n1. Сейчас очень много мошеннических и деструктивных каналов, с которыми я не хочу связываться"
              f"\n2. У меня нет времени проверять рекламодателей и вести с ними переговоры")

text_hello2 = (f"Поэтому я ввёл минимальную оплату за использование бота, чтобы сохранить его качество, независимость "
              f"и честность:"
              f"\n\n1 запрос — <b>30 ₽</b>"
              f"\n20 запросов — <b>349 ₽</b>"
              f"\n100 запросов — <b>1700 ₽</b>"
              f"\n\n<b>🔄 Оплата идёт на поддержку проекта.</b> Всё, что остаётся, — я направляю на "
              f"благотворительность. Получается, что в поисках себя, своего желаемого места в жизни, ты помогаешь не "
              f"только себе, но и еще кому-то в этом мире. Это идеальное распределение созидательной энергии 🙏")


text_info = (f"Правила пользования ботом")