text_privacy = (f'Этот документ описывает политику конфиденциальности для бота @MasterManifest_Bot '
                f'(Мастер Манифестации📖)'
                f'\n\n<b>Собираемая информация</b>'
                f'\nМы собираем следующие данные:'
                f'\n- Данные указанные в профиле, а именно Username пользователя '
                f'(это необходимо для реализации связи между продавцом и пользователем)'
                f'\n- Сообщения, отправленные боту'
                f'\n\n<b>Использование данных</b>'
                f'\nСобранные данные используются для:'
                f'\n- Обработки запросов пользователей'
                f'\n- Улучшения работы бота'
                f'\n- Анализа использования сервиса'
                f'\n\n<b>Хранение данных</b>'
                f'\nДанные хранятся на сервере без срока хранения'
                f'\n\n<b>Передача данных третьим лицам</b>'
                f'\nМы не передаем ваши данные третьим лицам без вашего согласия, за исключением случаев, '
                f'предусмотренных законом'
                f'\nИспользуя данный бот вы подтверждаете согласие на передачу ваших данных третьим лицам '
                f'\n\n<b>Изменения в политике конфиденциальности</b>'
                f'\nМы оставляем за собой право обновлять эту политику. Обо всех изменениях мы уведомим '
                f'вас через наш бот'
                f'\n\n<b>Контактная информация</b>'
                f'\nЕсли у вас есть вопросы, свяжитесь с администратором нашего сервиса '
                f'<a href="https://t.me/RomanMo_admin">@RomanMo_admin</a>')



text_offer = (f"<a href='https://telegra.ph/Politika-Konfidencialnosti-11-17-5'>Публичная оферта, Пользовательское "
              f"соглашение, условия эксплуатации и обслуживания </a>\n")


text_hello = (f"Меня зовут Даниил")



text_info = (f"Правила пользования ботом")